/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Недействительный параметр.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Недействительный код операции.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Не удалось соединиться с сервером. Проверьте данные входа.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "Пользователь уже в системе.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Операция уже выполняется.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Недействительный контекст операции.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "Недействительный ид. для протокола коммуникации.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "Недействительный ид. задачи.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Не удалось определить протокол коммуникации.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Проверьте пароль.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Это устройство уже зарегистрировано на другого пользователя.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "Введенные коды не совпадают.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Операция недопустима на этом статусе.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "Данные соединения недостаточны или недействительны. Повторите попытку.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Не удалось сбросить приложение. Проверьте наличие соединения с сетью.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Не удалось соединиться с сервером. Проверьте данные входа.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Проверьте имя и пароль.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Не удалось соединиться с сервером. Свяжитесь с администратором.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "Данные соединения недостаточны или недействительны. Повторите попытку.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Введите верный код доступа.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Введите код, содержащий минимум одну цифру.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "Введенные коды не совпадают.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "Действие кода истекло. Необходимо сменить код.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Введите код, содержащий не менее {0} символов.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Введите код, содержащий минимум одну строчную букву.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Введите код, содержащий минимум один специальный символ.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Введите код, содержащий не менее {0} уникальных символов.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Введите код, содержащий минимум одну прописную букву.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Не удалось получить ключ для сертификата.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Не удалось получить сертификат.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Неизвестная ошибка";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "Безопасное хранилище уже существует";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Ошибка типа данных";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "Безопасное хранилище не существует";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Недействительный аргумент";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Введите верный код доступа.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "Безопасное хранилище блокировано";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Недостаточно памяти в безопасном хранилище";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "Действие кода истекло. Необходимо сменить код.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Введите код, содержащий не менее {0} уникальных символов.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Введите код, содержащий минимум одну цифру.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Введите код, содержащий минимум один символ в нижнем регистре.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Введите код, содержащий минимум один специальный символ.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Введите код, содержащий минимум один символ в верхнем регистре.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Введите код, содержащий не менее {0} символов.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Введите код, содержащий не менее {0} уникальных символов.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "Безопасное хранилище удалено.";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Операция не поддерживается.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Недействительный пасс-код SSO.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Недействительные рег. данные Afaria.";

